<a href="https://colab.research.google.com/github/dalves87/ANALISE_DADOS_PANDAS_DIO/blob/master/Pandas_Excel_e_Datas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Trabalhando com Planilhas do Excel**

In [1]:
#Importando a biblioteca
import pandas as pd

In [2]:
#Leitura dos arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [3]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [4]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
#Exibindo as 5 Ãºltimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [8]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
101  Fortaleza 2019-01-01   11.67    1005     4
72     Aracaju 2018-01-01  168.95    1523     7
72      Recife 2019-01-01   42.32     982     2
30     Aracaju 2018-01-01  119.21    1520     8
3    Fortaleza 2019-02-10   20.95    1004     6

In [9]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [10]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [11]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [12]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [13]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [14]:
#Substituindo os valores nulos pela mÃ©dia
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [15]:
df["Vendas"].mean()

122.61180089485438

In [16]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [17]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
135      Natal 2019-01-02    9.95   1037     3
112     Recife 2019-03-02  133.59    982     1
9    Fortaleza 2019-01-01   11.17   1002     6
162   Salvador 2019-01-02   23.08   1036     2
41    Salvador 2019-02-13    9.86   1035     2
234      Natal 2019-01-03   48.39   1035     2
24    Salvador 2019-01-01   15.60   1034     2
67       Natal 2019-02-14  379.00    852     2
76    Salvador 2019-01-01   39.51   1035     3
7       Recife 2019-02-11   33.37    982     3
117   Salvador 2019-03-02   39.41   1034     1
56      Recife 2019-01-01    7.98    983     5
72    Salvador 2019-01-01  149.47   1036     3
18      Recife 2019-01-01   49.40    980     5
96    Salvador 2019-01-01   42.94   1034     3

In [18]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [19]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [20]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [21]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [23]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [24]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [25]:
#Encontrar a quantidade de produtos vendidos
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [26]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [27]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [28]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [29]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [30]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [31]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [32]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [33]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [34]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [35]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [36]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [37]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [38]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [39]:
df.sample(5)

        Cidade       Data  Vendas  ... Receita  Receita/Vendas  Ano_Venda
222   Salvador 2019-01-02   43.96  ...   43.96             1.0       2019
9       Recife 2019-01-01   11.85  ...   82.95             7.0       2019
129  Fortaleza 2019-03-02   35.34  ...  247.38             7.0       2019
108   Salvador 2019-03-02   11.72  ...   11.72             1.0       2019
100  Fortaleza 2019-01-01   18.58  ...   18.58             1.0       2019

[5 rows x 8 columns]

In [40]:
#Extraindo o mÃªs e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [41]:
df.sample(5)

       Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
24      Natal 2018-04-22  868.00  ...      2018          4         22
32      Natal 2019-03-17  244.00  ...      2019          3         17
97   Salvador 2019-01-01   39.91  ...      2019          1          1
176  Salvador 2019-01-02   19.42  ...      2019          1          2
32     Recife 2019-01-01   15.93  ...      2019          1          1

[5 rows x 10 columns]

In [42]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [43]:
#Calculando a diferenÃ§a de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [44]:
df.sample(5)

        Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
91     Aracaju 2018-01-01  200.85  ...         1          1          0 days
33   Fortaleza 2019-01-01   19.56  ...         1          1        365 days
15      Recife 2019-01-01    7.45  ...         1          1        365 days
43     Aracaju 2018-01-01   19.63  ...         1          1          0 days
138     Recife 2019-03-02  150.38  ...         3          2        425 days

[5 rows x 11 columns]

In [45]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [46]:
df.sample(5)

       Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
221     Natal 2019-01-02  142.23  ...         2        366 days                1
209  Salvador 2019-01-02   69.98  ...         2        366 days                1
17     Recife 2019-02-14  142.45  ...        14        409 days                1
85     Recife 2019-01-01  182.52  ...         1        365 days                1
152     Natal 2019-01-02   20.07  ...         2        366 days                1

[5 rows x 12 columns]

In [47]:
#Filtrando as vendas de 2019 do mÃªs de marÃ§o
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [48]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
129   Salvador 2019-03-02  125.66  ...         2        425 days                1
132   Salvador 2019-03-02   19.61  ...         2        425 days                1
69       Natal 2019-03-24  817.00  ...        24        447 days                1
122   Salvador 2019-03-02   13.27  ...         2        425 days                1
108     Recife 2019-03-02  152.89  ...         2        425 days                1
132  Fortaleza 2019-03-02   17.49  ...         2        425 days                1
128  Fortaleza 2019-03-02   38.70  ...         2        425 days                1
115  Fortaleza 2019-03-02   12.23  ...         2        425 days                1
133     Recife 2019-03-02   14.67  ...         2        425 days                1
130     Recife 2019-03-02   12.36  ...         2        425 days                1
134  Fortaleza 2019-03-02  195.18  ...         2        425 days                1
115   Salvador 2019-03-02  202.33  ...         2        425 days                1
113  Fortaleza 2019-03-02   38.63  ...         2        425 days                1
19       Natal 2019-03-31  282.00  ...        31        454 days                1
134   Salvador 2019-03-02  125.90  ...         2        425 days                1
114   Salvador 2019-03-02   25.52  ...         2        425 days                1
139     Recife 2019-03-02  141.16  ...         2        425 days                1
117     Recife 2019-03-02   15.42  ...         2        425 days                1
114     Recife 2019-03-02   16.82  ...         2        425 days                1
133  Fortaleza 2019-03-02   14.67  ...         2        425 days                1

[20 rows x 12 columns]